{
  "home": [
    {
      "id": 1,
      "email": "gagglepod@gmail.com",
      "isActive": true
    }
  ],
  "prices": [
    {
      "id": 1,
      "category": "Personal",
      "price_annaul": "17",
      "price_monthly": "19",
      "currency": "USD",
      "downloads": "12000",
      "podcasts": "Unlimited",
      "storage": "Unlimited"
    },
    {
      "id": 2,
      "category": "Professional",
      "price": "44",
      "price_monthly": "49",
      "currency": "USD",
      "downloads": "60000",
      "podcasts": "Unlimited",
      "storage": "Unlimited"
    },
    {
      "id": 3,
      "category": "Business",
      "price": "90",
      "price_monthly": "99",
      "currency": "USD",
      "downloads": "150000",
      "podcasts": "Unlimited",
      "storage": "Unlimited"
    }
  ],
  "tickets": [
    {
      "id": 1,
      "about": "Help Title",
      "issue": "Issue Description",
      "email": "leafbreeze@gmail.com",
      "account": "https://oncetold.cloud/8675309"
    },
    {
      "about": "Cannot Log in",
      "issue": "When I log in nothing happens",
      "email": "leafbreeze@gmail.com",
      "account": "https://oncetold.cloud/8675309",
      "id": 2
    }
  ],
  "posts": [
    {
      "id": 1,
      "title": "How to transform your book into a podcast",
      "author": "Kyle M. Bondo",
      "img": "books-1280x720.jpg",
      "thumb": "placeholder-image-wide.png",
      "tags": [
        "AX Design Basics",
        "Strategy"
      ],
      "summary": "Give your book a second life by converting it into 52 episodes of a weekly podcast.",
      "body": "<p>Did you write a book? Or create 52 episodes of a weekly podcast?<\/p><p>Writing a book is hard. Selling a book is even harder. They don't call it the <em>Best Writing Author<\/em> — they call it the <em>Best Selling Author<\/em>! Ouch, right? Now, you sit on the long tail of Amazon's platform waiting for a nibble or two. All that work you put into writing a book only to have sales flatline.<\/p><p>It's time to give that book a second life! How do you give it a second life? What if you could tell your story and sell your book at the same time? What if you could use all the content in your book to help drive sales to your book? You can with a podcast based on your book!<\/p><p>The strategy is simple to understand, but difficult to execute. Here's a quick breakdown:<\/p><p><strong>#1 — Podcast Design:<\/strong> First, you will need to design a podcast based on your book's main premise.<\/p><p><strong>#2 — Podcast Schedule:<\/strong> Next, you'll need to break your book up into 52 logical mini-topics, or topics that can be self-contained within a 20-60 minute audio episode. This can be segmented with your first episode that introduces your podcast, special episodes, and even interviews based on relevance to your topic.<\/p><p>All in all, you really only need to come up with 40+ episodes actually based on your book's content. That should not be too difficult if you think about how your book is already organized. There's no need to recreate the wheel. Just follow your book's natural progression from episode to episode. Tell your story in spoken word audio the same way a reader would experience it themselves. If you think about your podcast as a reader would your book, 40+ episodes are really the 10-12 chapters of your book broken down into stand alone themes. Then within each of those chapter themes are possibly 3 or more sub-themes. Enough content for at least one year's worth of weekly podcasting (or more).<\/p><p><strong>#3 — Podcast Book Promotion:<\/strong> Finally, turn your stagnant book sales into a 52 episode audio series where each episode features your book as the content and the sponsor. The ads become your ads. The deals and sales become your deals and sales. When you control the content and the ads, everything comes to you. Not only can you expose listeners to each of your books main points, but you can engage with them, hear from them, and find out what they think of you and your concepts.<\/p><p>This gives you tremendous leverage over other books on your topic. Other peoples books are just books. Your podcast on your book can become BONUS content for your book by including amplifying thoughts, additional viewpoints, and new information. Think of it as the <em>Directors Cut<\/em> of your book, only given out in 52 bite-sized chunks.<\/p><p>This strategy has a huge side benefit too. It helps you flesh out ideas for Book Number Two while you engage with real fans using content from Book Number One. This is A/B testing of a book you haven't even written yet.<\/p><p>Furthermore, it can lead you to entirely different directions with content already tested to be what your audience wants. When you know what your audience wants, your can turn <em>Best Selling Author<\/em> into <em>Top Ranked Influencer<\/em> on your topic. It takes converting your book into a podcast to realize these advantages.<\/p><p>However, podcasting your book is not for those that only want to <em>try it out<\/em>. This is a strategy that requires you to become dedicated to podcasting for at least 1-year. In other words, you have to commit if this strategy is going to have any chance of working!<\/p><p>Are YOU are ready to do the work that will save your book sales? If so, you have a huge advantage over most new podcasters. You not only have a year's worth of content to work with up front, but you also have a book to sell with your podcast. This gives authors something most podcasters wish they had: a head start!<\/p><p><strong>And now you know!<\/strong><\/p>"
    },
    {
      "id": 2,
      "title": "Keep them coming back to you",
      "author": "Kyle M. Bondo",
      "img": "mobile-1280x720.jpg",
      "thumb": "placeholder-image-wide.png",
      "tags": [
        "Process",
        "Branding"
      ],
      "summary": "Create an effective way to promote your company's brand to a new audience by developing your own podcast strategies.",
      "body": "<p>Building an audience for your podcast is hard.<\/p><p><em>Why is it hard?<\/em><\/p><p>Because it requires constant vigilance, repeated processes, and continuous determination.<\/p><p>In other words, you have to work for your audience.<\/p><p>No podcaster is given an audience.<\/p><p>You have to earn it.<\/p><p>But before you can do that, you have to first go out there and:<\/p><ul><li>Step #1 - Find out where your audience lives online and in the marketplace<\/li><li>Step #2 - Connect with your audience and earn their trust<\/li><li>Step #3 - Then convince them to become listeners with compelling content<\/li></ul><p>Again, that requires work.<\/p><p>Lots and lots of work.<\/p><p>So roll up your sleeves and get ready to do what it takes to earn an audience!<\/p><p><strong>Step #1 - Find</strong><\/p><p>First, you need to find your audience. Ask yourself this question: <em>Where does your audience live?<\/em> It's your topic, your passion, and the core to your podcast. As a result of being a subject matter expert, you probably know where your audience goes for information, conversation, and debate. A simple way to consider this is to think about is:<\/p><ul><li>What does your audience read?<\/li><li>Where does your audience shop?<\/li><li>What does your audience buy?<\/li><li>Where does your audience share their thoughts?<\/li></ul><p>This is what it means to find out where your audience lives. Many of your audience members live online. Social media like Facebook, Twitter, and Instagram are great places to start.<\/p><p>However, not everyone is producing a podcast that has a big online audience. In that case, ask yourself:<\/p><ul><li>What does your audience read?<\/li><li>What events do your audience attend?<\/li><li>Where does your audience hang out?<\/li><li>Where does your audience work?<\/li></ul><p>Finding your audience in the real world is just as relevant as finding them on the Internet. Once you find your audience or a location where your potential audience congregates it's time to watch them. Like a nature photographer or even a big game hunter, you need to watch your target audience with great enthusiasm. You're looking for them to tell you something about their position on your topic. These observations should include an understanding about:<\/p><ul>li>What do they complain about?<\/li><li>What are their pains?<\/li><li>What are their likes?<\/li><li>What are their loves?<\/li><li>What is controversial?<\/li><li>What is the topic everyone is talking about?<\/li><li>What is the topic no one is talking about?<\/li></ul><p>Observer our audience with the same passion as you would present your topic. What you learn will greatly influence what comes next.<\/p><p><strong>Step #2 – Connect</strong><\/p><p>Knowing what your audience is doing will become very valuable to your show preparations. Ideally, you want to now inject yourself into the conversation Not to pimp your podcast. Jumping in only to promote yourself will only alienate you and poison the well to your podcast engagement efforts. Instead, you need to do the following:<\/p><ul><li>Give<\/li><li>Give<\/li><li>Give<\/li><li>Give<\/li><li>Give<\/li><li>Then promote yourself<\/li><li>Then give some more<\/li></ul><p>No, you don't see a mistake there. It does say <em>“Give”<\/em> five times. This the formula to engaging with your audience online or even in real life. Before you can sell anyone on your podcast, you need to give back first. You need to start being a member of the community and begin showing folks that you really do care about this subject.<\/p><p>Start with answering questions. Plenty of places — especially groups on Facebook — have new members that need beginner help. Start with reaching out to those getting into your topic and telling them the answer (from your point of view), or where they can find the answer Think about your topic and start asking questions yourself. Ask about the controversial, ignored, or hot topics to see what kind of conversation you can get started. But always do it from a place of service. Give your knowledge, your best tips, your time-tested advice, and your lessons learned freely. Follow in the footsteps of others that give away their own knowledge with a catch. You're not there to sell them, you're there to give to them. Then do it over and over and over again. Become the “go to” subject matter expert or someone people think of when they do get stuck or confused.<\/p><p>In parallel with building your reputation with your target audience, you should be collecting each of those conversations with a purpose.<\/p><p>That purpose is to reuse that content in your show. If you have a hotly contested conversation within your audience group online, carry that over into an episode. Don't replay the conversation word for word, but use it as a jumping off point for your podcast. Build episodes around those discussions where you take what you offered as advice and restate it in a podcast. Take your point of view and present a solution to any given problem. Use the issues and problems you encounter within your audience as the foundation for both micro and macro solutions that you talk about.<\/p><p>Several micro conversations might form one consolidated episode, while one macro conversation might become a theme for several episodes in a series. There also could be topics that don't have solutions or have two equally good solutions. This is the Apple versus PC or Coke versus Pepsi arguments. In this case, you're either going to need to take a side (and stick to it) or bring guests onto your show to argue the other side. This is what it is to Connect your audience. By observing them in the wild, you already know what everyone is talking about.<\/p> <p><strong>Step #3 - Convince</strong><\/p><p>Connecting with your audience now gives you a huge advantage. You now have a content generation machine just full of good ideas for future episodes. This will make your podcast relevant, it will give your content value that his compelling to your target audience. <em>Does it always have to be what your audience is interested in?<\/em> Of course not! It's your show. You can present or ignore any subject you feel like presenting or ignoring. It gives you the option to focus on topics that everyone in your group is talking about, or to bring up topics that your audience may not have considered.<\/p><p>This gives you power over the conversation. It also makes you look very involved with your topic. However, if you remember the advantage you have over others by finding out what your audience is NOT talking about? You now have the power to bring those topics up as you see fit too. Having knowledge of what everyone is and is not talking about provides you with a very big picture view of your topic.<\/p><p>Additionally, when the time comes for you to change the subject, you now have all the topics and issues ready to go before anyone else.This is the core to the Convince step in the process: <em>Leadership!<\/em> Once you have a strong relationship with your audience groups, you now have the capability to start leading the conversation. This process starts with deciding what you think everyone should be talking about. Looking at all that has been said by your audience, the trends in your topic, and what podcast episodes you have already created, pick a topic that you feel strongly about. This could something that was already discussed, but chances are there is something you have been wanting to talk more about.<\/p><p>Then, when you're ready, the next time you connect with your audience, present this topic as a new conversation. Only in this new discussion, relate it back to the podcast episode on the same topic. This makes your podcast a continuation of what you're talking about, not the sole reason for talking about it. You already give away your best tips. Only now you can start to safely promote specific podcast episodes that relate back to the discussion you are starting.<\/p><p>Extending the conversation this way should always be in connection with something relevant. Don't push people to an episode that does not extend the conversation. What you will find with this step is that it start to lead people interested in learning more right to your podcast without looking like you are leading them to it. It is simply an extension of a discussion that can only come AFTER you have gained your audience's trust. <\/p><p>If you have presented the content in a helpful way, then some of those visitors to your podcast will become subscribers. Finding out where they live and becoming a trusted source is essential to producing subscribers that become fans of your podcast. Listeners don't subscribe on accident. But sometimes they need a reason to choose you over all the other podcasts out there. Give them a compelling reason by earning their trust first. The rest will follow.<\/p><p><strong>And now you know.</strong><\/p>"
    },
    {
      "id": 3,
      "title": "The Content Wars Cometh: Is your podcast ready?",
      "author": "Kyle M. Bondo",
      "img": "storm-1280x720.jpg",
      "thumb": "placeholder-image-wide.png",
      "tags": [
        "Strategy",
        "Value"
      ],
      "summary": "When your new story idea becomes more valuable than ever before, will you be ready?",
      "body": "<p>There is a storm coming called <em>The Content Wars<\/em>.<\/p><p>Not unlike <a href='https://www.cbr.com/marvels-secret-wars-how-comics-first-event-changed-everything/' target='_blank'>Marvel Secret Wars<\/a>, which changed Marvel comics forever (e.g. the true origin of Spiderman's black suit), the Content Wars are about to change the motivation behind why creators use podcasting, video, and live streaming to tell their stories.<\/p> <p>The first indications of this coming war have already started within the hallowed halls of movie and TV executive producer offices. After Hollywood combed the depths of remakes from the 80s and 90s, then bought up every book option from Harry Potter to Twilight, they are in search of new stories to feed the insatiable beast called demand. They have already begun using podcasting and on-line video to prototype new TV and Movie content (e.g. <a href='https://gimletmedia.com/shows/homecoming' target='_blank'>Homecoming<\/a>, <a href='https://www.amazon.com/Lore-Season-1/dp/B074N8MFJ3' target='_blank'>Lore<\/a>, <a href='https://wondery.com/shows/dr-death/' target='_blank'>Dr. Death<\/a>).<\/p><p>What is coming next is a tidal wave of intellectual property (IP) experimentation that will include both known A/B/C level actors (who need to work) and new actors who can make a name for themselves with minimal studio financial risk (e.g. the Audio Drama <em><a href='https://podcasts.apple.com/us/podcast/the-oyster/id1538224217' target='_blank'>The Oyster<\/a><\/em> from <a href='https://www.theparagoncollective.com/' target='_blank'>The Paragon Collective<\/a> stars like Logan Browning (The Perfection), Mamoudou Athie (Jurassic World), Carla Gugino (Haunting of Hill House), Keith David (Greenleaf), Giancarlo Esposito (Breaking Bad), to name a few). Fortunately, for content creators, executive production studios will need more stories to produce than ever before to feed this war. This is how a whole new cadre of podcasters, video storytellers, and even live streamer talent will have the opportunity to become their own showrunners, writers, and producers for REAL production companies that pay big money.<\/p><p>Additionally, this will create a new door for audio drama and audio fiction podcast producers to enter the world of entertainment media by either sharing their original IP with the world or by selling the rights to their unique IP for millions.<\/p><p>Unfortunately, this coming Content War will have its casualties when the content gold rush will make studios fight over content. The introduction of new podcast platforms (e.g. Amazon, Spotify) in combination with a big push into streaming services (e.g. Netflix, Hulu, Disney+, Discovery+, HBO Max) has already shown how desperate studios are to meet this demand. This means as the Content Wars heat up into a buying frenzy many of these new IPs and newfound talent will fall short. Companies will buy up the rights to individual podcasts, video series, streaming show ideas, online networks, and endless amounts of audio content — to include anything not nailed down or copyrighted — to make sure they get it first. Many podcasts, video creators, and live streamers are going to become very wealthy during this Content War bubble. But in the end, will lose their shows to the juggernaut that will sweep through our industry in search of the next best thing.<\/p><p>When this Content War ends, who will be left standing? Will it have all been worth it? <\/p><p>I believe those that have invested heavily into their show have a very good chance of seeing the Content Wars elevate their idea into a major IP that is remembered for decades. Yet, the only way any of us benefit from this is to have something of value ready to share with the world.<\/p><p>When your new story idea becomes more valuable than ever before, will you be ready? Is your show ready for the coming Content Wars?<\/p><p>It better be! <a href='http://podwrecked.com/the-future-is-nigh/' target='_blank'>Because there is a storm coming...<\/a><\/p>"
    },
    {
      "id": 4,
      "title": "The deep well using independent podcasters at scale",
      "author": "Kyle M. Bondo",
      "img": "pointer-1280x720.jpg",
      "thumb": "placeholder-image-wide.png",
      "tags": [
        "Strategy",
        "Tips & Tricks"
      ],
      "summary": "The powerful yet cost-effective street team your company is ignoring",
      "body": "<p>There are many companies out there that have a new product with no one ready to buy it.<\/p><p>Usually, they have a marketing arm full of salespeople ready to flood the world with their copy: Please buy X! This is the on-ramp to customer acquisition that so many startups and innovators have to go through.<\/p><p>Unfortunately for small businesses, that team of marketers is usually one person. Worse yet, sales are not that persons full-time gig! It is just one of a hundred other gigs they have to do in any given day.<\/p><p><strong>Old Thinking</strong><\/p><p>So what is a company to do with this new product when creating an audience is both costly and time-consuming? Furthermore, what is a company to do when their tiny product team has spent every waking moment <em>building<\/em> the product and spent zero time advertising or marketing it?<\/p><p>I would like you to consider this very underused strategy: sponsorships. But not just any kind of sponsorships, but the sponsorship of a very specific kind. The sponsorship of podcasting events. You might be thinking as many other companies think about events. They look at events as a loss-leader. They know that spending money on a vendor booth will cost them. They know that sending knowledgeable staff to the event will also cost them. After crunching the numbers they will come up with a formula that will give them a dollar amount that will represent <em>how much a new customer acquisition will cost me<\/em> and <em>how many new customers I will need to acquire at this event<\/em> to <em>make it worth my while<\/em>.<\/p><p>In business words, this is called ROI - Return on Investment. If I sink, let's say $5,000 into an event, then I need to get <em>at least<\/em> $5,000 worth of sales from it. They would like to double or triple that number — or in startup land speak they would like to 10x that baby!<\/p><p>If that company becomes a sponsor of the event, they really need to have an advantageous position. This could include being allowed to have one of their employees (usually the CEO or president of the company) come speak, their logo and branding all over the place, and reference to how grateful the event host is for having them defer the crazy costs of putting on a podcasting event in the first place. In fact, the more the sponsor gave the event organizer is directly proportional to how many times they are thanked during the event.<\/p><p>Solve for X.<\/p><p>What happens if the company puts out all this money and nobody buys their product? Sorry. That's the cost of doing business. Sometimes these events don't pan out and sometimes it takes two or three years worth of sponsorships before you see the needle move.<\/p><p><strong>New Thinking<\/p></strong><p>I've attended a few podcasting events this year with one more coming up — <a href='https://www.dcpodfest.com/'>DC Podfest in Washington DC<\/a>. At all of these events, you will find an assortment of companies, all pushing their various products complete with stickers, free t-shirts, and even stress balls. They are all trying to acquire new customers <em>AT<\/em> the podcasting event. Why? Because they are marketing their products <em>TO<\/em> podcasters.<\/p><p>However, the one thing these companies are <em>NOT<\/em> doing is finding the potential audience that is right in front of their face. You see, a typical podcasting conference can range from 100 to 500 people. A large majority of podcasters are there to learn something new about podcasting but a strong majority of them are truly <em>WISHING<\/em> they could make money with it too. Few make that money but they all dream of one day quitting their meaningless jobs and becoming full-time podcasters. A typical company selling a product <em>TO<\/em> podcasters sees the attendee as a customer. Just one customer.<\/p><p>I see an attendee as a potential raving fan with an army of potential customers hiding under their podcasting hood!<\/p><p>Open your mind and follow me down this rabbit hole for a moment. Your company wants to sell a product and needs staff to get that product in front of as many people as possible for as long as possible. Now think about how much that staff will cost you. Pretend it's 5 college grads with an annual salary of $30,000 each. That will cost you — in salary alone — $150,000 for one year. Your expectations will be that they sell at least that much in products in the same year. If they don't? Well, doom on them.<\/p><p>With me so far? Good!<\/p>p>Now, look at that hungry podcaster over there who you only see as one customer. That podcaster is talking to at least 30-100 people a week — FOR FREE! There are no one-size-fits-all podcasters so each one has a different audience size. But for the sake of argument, let's say the average podcaster has an audience size of 200 weekly listeners. That is 200 people — potential customers — tuning in to that one podcaster every week. Chances are, that podcaster has NEVER had an advertisement on their podcast.<\/p><p>Why? Because they have NEVER had an advertiser consider them worthy of one!<\/p><p><strong>Approaching an Independent Podcaster<\/p></strong><p>Here's what happens when you look right at a podcaster you meet at a podcasting conference and ask them if you would like to advertise your product:<\/p><p>First, they freak out! Nobody has ever given care about their little podcast long enough to give them this opportunity so they are both excited and humbled.<\/p><p>Next, they suddenly become a fan of your product. They may have liked it before this, but now they have a renewed interest in giving you the best light possible to as many people that will listen.<\/p><p>Finally, they will never ask for too much to promote your product. Why? Because “they don't know what to ask for.” Remember the first point? No advertiser has ever cared enough to give them the time of day so they are very new at this entire process.<\/p><p>When you find a podcaster like this and have vetted them enough to know they're not a whack-a-doodle, you can do something that few companies will do: you can negotiate a very low cost compared to how much your product will be promoted. The funny thing about podcasters is that they all have media hosting costs, gear expenses, SaaS tool subscription fees, website costs, and time investment costs. They also have mortgages, car payments, and smartphone bills too. As a small company, you can turn one good independent podcasters into a marketing machine for as little as $100 per episode.<\/p><p>Now consider this calculus when thinking about hiring a marketing team. One good podcaster with a weekly audience of 200 will tell that audience about your product 52 times in one year. Additionally, that podcaster will tell their friends, family, social media, and fellow podcasters about how you took a chance on them about 10x that number. Plus, their audience will ebb and flow as they produce their show. The better they get at podcasting, the bigger audience they could attract. Now your $100 per episode ad just grew without any change in the price.<\/p><p>With one podcasters you turn one customer into an entire street team of marketers for a fraction of the cost. As you grow your stable of podcasters you can start doing other cool things like A/B testing, specialize affiliate links that will show you which podcaster is doing more for you, and if your podcast ads are bringing in sales. Unlike magazines, pay per click advertising, or even social media ads, you have real people connecting with other real people in a way that ads legitimacy to your company.<\/p><p>There are so many good yet hungry podcasters out there with so many small companies ignoring them and their potential.<\/p><p><strong>Take This One Step Further<\/p></strong><p>You may ask yourself, <em>“Where do I find these podcasters?”<\/em> And that is where the Podcasting Conference is your treasure trove of recruits.<\/p><p>A podcasting conference is a community of podcasters just waiting to be discovered by your company. They are there to hone their skills, share tips and tricks with each other, and learn something new. That makes them the perfect candidates for this strategy. Finding a podcaster with a small yet loyal audience is one thing, but finding a podcaster that cares enough about their show to continually make it better, is the attitude you want. Podcasters are content creators. The better their content creation, the bigger their audience can get.<\/p><p>Additionally, many podcasting conferences have speakers who are teaching podcasting skills to attendees. 99-percent of these speakers are doing this for free. They've amassed enough podcasting knowledge to turn their own podcast experience into a teaching tool or even a real business. These podcasters are in it for all the marbles which is what you want in an advertising partner. You don't want to have a podcaster accept your money only to fold shop the next day. By looking hard at podcasters that spend enough time to create a conference talk you will find individuals that are trying to make a stable living with their <em>podcraft<\/em>. They are going to be your mustangs — the workhorses that will make every one of your advertising dollars count.<\/p><p>However, if you're not at these podcasting conferences, you're missing out on the unique opportunities these independent media publishing companies called “podcasters” present. Every conference I've been two in the past 3 years if full of either media hosting FOR podcasters, tools FOR podcasters, or some kind of service FOR podcasters. Where are the small companies and startups looking to connect WITH podcasters TO market their products? Nowhere. They don't come. They don't sponsor events. Heck, they don't even know these conferences exist!<\/p><p><strong>The Street Team Everyone is Ignoring<\/p></strong><p>The Internet has changed everything. Instead of big media companies controlling all the channels, individuals control what content they want and when they want it. When a TV commercial comes on, people look at their phones. When an ad plays before you Youtube video, people wait for the 5-seconds and press the skip its link. But podcasting? The numbers don't lie. Podcasting advertisements are more listened to, more engaging, and appeal to a far younger audience.<\/p><p>Yet, all this marketing potential is being ignored when you don't even consider how a small $1,000, $2,500, or even a $5,000 sponsorship of a podcasting event could be your conduit to a podcasting audience in the tens-of-thousands. Not only would you be one of only a handful of companies that gave a care about helping the conference take place, but you would have 2-days of uninterrupted interviewing opportunities. With that time you could meet, judge, vet and connect with dozens of podcasters with all sorts of topics and audiences. It could be just the punch in the arm your company needs to get off the ground.<\/p><p>Please understand that independent podcasters can smell bad intentions from a mile away. And if they don't believe in your product or are selling something smarmy, most of them will pass on you. But if you back your products with the same commitment and enthusiasm you show this small but powerful podcasting community, the ROI you can create will certainly make a dent in your bottom line.<\/p><p>So, the next time you think you need to hire a marketing team or have a new product that needs some love, consider how powerful yet cost-effective a podcaster partnership could be. We — independent podcasters — are all dreaming of being legitimized by having an advertiser. We've spent years perfecting our shows, building a small but loyal following, and creating endless amounts of new and interesting content. You will be surprised how grateful we can be by having your company take an interest in what we've built.<\/p><p>All you have to do is <em>show up and ask<\/em>!<\/p>"
    }
  ]
}